code-review/NRB_3471_3546/База_Было/Documents/ПлатежнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлатежнаяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВнешнегоИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленныйНалог</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачисленныйНалог</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаДохода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыНазначенияБанковскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНазначенияБанковскихСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВкладДепозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйТранзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брокерский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскийТранзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныйТранзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачисленныйНалог</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалоговаяБазаВыплатыДоходов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаПоСтавке15СПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ1СИЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаЗНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогОбычнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаПовышенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаИПДНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаСОИДН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкиНалогаУстановленыВРучномРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ПлатежнаяОперация/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Создать платежные операции по поручению
//
// Параметры:
//  Основание			 - ДокументСсылка.Поручение	 - Поручение, на основании которого созадются платежные операции
//  КлючСтрокиПоручения	 - Структура				 - Структура с ключами: СчетДепо, РазделСчетаДепо (Неопределено - по всему поручению в целом)
//  Отказ				 - Булево					 - Признак ошибки
//  ВТранзакции			 - Булево					 - Принзнак выполнять в Транзакции (если вызов делается не из модуля проведения)
//
Процедура СоздатьПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения, Отказ, ВТранзакции = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РазрешеныПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения) Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	РазмерШкалыНалогов = 2;
	
	БезПлатежей = Истина;
	ДанныеНалоговыхДокументов = Документы.Поручение.ДанныеНалоговыхДокументов(Основание, КлючСтрокиПоручения, БезПлатежей);
	
	Если ВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		Если КлючСтрокиПоручения = Неопределено Тогда
			ОснованиеЦенныеБумагиСписываемые = Основание.ЦенныеБумагиСписываемые;
		Иначе
			ОснованиеЦенныеБумагиСписываемые = Основание.ЦенныеБумагиСписываемые.НайтиСтроки(КлючСтрокиПоручения);
		КонецЕсли;
		Для Каждого СтрокаПоручения Из ОснованиеЦенныеБумагиСписываемые Цикл
			
			ЕстьНалоги = Ложь;
			Отбор = Новый Структура("СчетДепо, РазделСчетаДепо", СтрокаПоручения.СчетДепо, СтрокаПоручения.РазделСчетаДепо);
			Налоги = ДанныеНалоговыхДокументов.НайтиСтроки(Отбор);
			Если Налоги.Количество() > 0 Тогда
				ЕстьНалоги = Истина;
			КонецЕсли;
			
			Если ЕстьНалоги Тогда
				СоздатьПлатежныеОперацииПоНалоговойСтрокеПоручения(Основание, КлючСтрокиПоручения, СтрокаПоручения, Налоги[0], РазмерШкалыНалогов);
				ОтправитьУведомлениеОПодтвержденныхНачисленияхНалога(Основание, КлючСтрокиПоручения);
			Иначе // Только одна платежная операция по выплате дохода
				ПлатежнаяОперацияСоздатьПолучить(Основание,
					Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода,
					0,
					?(СтрокаПоручения.СуммаКВыплатеПоИПД > 0, СтрокаПоручения.СуммаКВыплатеПоИПД, СтрокаПоручения.Сумма),
					СтрокаПоручения);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		Если ВТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		УровеньОшибка = УровеньЖурналаРегистрации.Ошибка;
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ШаблонСообщения = "Не удалось создать платежные операции по [%1]. Причина: %2";
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Основание, ТекстОшибки);
		ЗаписьЖурналаРегистрации("Платежные операции: создание",
			УровеньОшибка,
			Метаданные.Документы.ПлатежнаяОперация,
			Основание,
			ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура - Выполнить создание документов Платежная операция по данным из Kafka
//
// Параметры:
//  Выборка	 - Выборка - Выборка данных из РС ЖурналВходящихСообщенийKafka
//
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСвойстваОписаниеОшибки = "ОписаниеОшибки";
	ИмяСобытия = "СозданиеПлатежныхОперацийПоДаннымKafka";
	
	ТекстОшибки = "";
	
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
		Если ВРег(СокрЛП(MessageInfo.SystemSource)) <> "DIAS" Тогда
			Возврат;
		КонецЕсли;
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить(ИмяСвойстваОписаниеОшибки, ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		Data = Сообщение.Data;
	Исключение
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить(ИмяСвойстваОписаниеОшибки, ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ДанныеПлатежа1С = ДанныеДляОбновленияПлатежныхОпераций(Data);
		ОбновитьПлатежныеОперации(ИмяСобытия, Data, ДанныеПлатежа1С, ТекстОшибки);
		
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		СообщенияПользователюСтрока = "";
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
				СообщенияПользователюСтрока = СообщенияПользователюСтрока + Символы.ПС + СообщениеПользователю.Текст;
			КонецЦикла;
		КонецЕсли;
		ТекстОшибки = ?(ЗначениеЗаполнено(СообщенияПользователюСтрока), СообщенияПользователюСтрока, ТекстОшибки);
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		MessageInfo.Вставить(ИмяСвойстваОписаниеОшибки, ОписаниеОшибки);
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Есть непроведенные платежные операции
//
// Параметры:
//  ТекущаяПлатежнаяОперация - ДокументСсылка.ПлатежнаяОперация			 - Проводимая ПлатежнаяОперация
//  ВидОперации				 - ПеречислениеСсылка.ВидыПлатежныхОпераций	 - Вид платежной операции
// 
// Возвращаемое значение:
//   - Булево - Если по строке Поручения, для которого проводится ТекущаяПлатежнаяОперация, есть еще непроведенные платежные операции
//
Функция ЕстьНепроведенныеПлатежныеОперации(ТекущаяПлатежнаяОперация, ВидОперации) Экспорт // BSLLS:Typo-off
	
	РеквизитыПлатежныхОпераций = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяПлатежнаяОперация,
		"ВидОперации, Основание, СчетДепо, РазделСчетаДепо");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежнаяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	НЕ ПлатежнаяОперация.ПометкаУдаления
	|	И НЕ ПлатежнаяОперация.Проведен
	|	И ПлатежнаяОперация.Ссылка <> &ТекущаяПлатежнаяОперация
	|	И ПлатежнаяОперация.ВидОперации = &ВидОперации
	|	И ПлатежнаяОперация.Основание = &Основание
	|	И ПлатежнаяОперация.СчетДепо = &СчетДепо
	|	И ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо";
	
	Запрос.УстановитьПараметр("ТекущаяПлатежнаяОперация"	, ТекущаяПлатежнаяОперация);
	Запрос.УстановитьПараметр("ВидОперации"					, РеквизитыПлатежныхОпераций.ВидОперации);
	Запрос.УстановитьПараметр("Основание"					, РеквизитыПлатежныхОпераций.Основание);
	Запрос.УстановитьПараметр("СчетДепо"					, РеквизитыПлатежныхОпераций.СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо"				, РеквизитыПлатежныхОпераций.РазделСчетаДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает разрешены ли платежные операции по поручению
//
// Параметры:
//  Основание			 - ДокументСсылка.Поручение	 - Поручение, на основании которого созадются платежные операции
//  КлючСтрокиПоручения	 - Структура				 - Структура с ключами: СчетДепо, РазделСчетаДепо (Неопределено - по всему поручению в целом)
// 
// Возвращаемое значение:
//   - Булево - признак того, что по поручению разрешено создавать платежные операции
//
Функция РазрешеныПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения = Неопределено) Экспорт
	
	Условие1 = (КлючСтрокиПоручения = Неопределено)
		Или Не ЕстьПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения);
	
	ВидОперацииД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидОперацииД");
	Условие2 = ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") И ВидОперацииД.ВыплатаДоходаВДенежнойФорме;
	
	Возврат Условие1 И Условие2;
	
КонецФункции

// Возвращает есть ли платежные операции по поручению
//
// Параметры:
//  Основание			 - ДокументСсылка.Поручение	 - Поручение, на основании которого созадются платежные операции
//  КлючСтрокиПоручения	 - Структура				 - Структура с ключами: СчетДепо, РазделСчетаДепо (Неопределено - по всему поручению в целом)
//  Проведен			 - Булево					 - Призак проведения
// 
// Возвращаемое значение:
//   - Булево - признак того, что по поручению уже есть платежные операции
//
Функция ЕстьПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения = Неопределено, Проведен = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежнаяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	ПлатежнаяОперация.Основание = &Основание
	|	И НЕ ПлатежнаяОперация.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ПоВсемСчетамИРазделам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПлатежнаяОперация.СчетДепо = &СчетДепо
	|					И ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо
	|		КОНЕЦ
	|	И ПлатежнаяОперация.Проведен = &Проведен";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Проведен", Проведен);
	Если КлючСтрокиПоручения = Неопределено Тогда
		Запрос.УстановитьПараметр("ПоВсемСчетамИРазделам", Истина);
		Запрос.УстановитьПараметр("СчетДепо", Неопределено);
		Запрос.УстановитьПараметр("РазделСчетаДепо", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("ПоВсемСчетамИРазделам", Ложь);
		Запрос.УстановитьПараметр("СчетДепо", КлючСтрокиПоручения.СчетДепо);
		Запрос.УстановитьПараметр("РазделСчетаДепо", КлючСтрокиПоручения.РазделСчетаДепо);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Функция - Платежная операция по GUID
//
// Параметры:
//  GUID - Строка - GUID строкой
// 
// Возвращаемое значение:
//   - ДокументСсылка.ПлатежнаяОперация - Ссылка на платежную операцию
//
Функция ПлатежнаяОперацияПоGUID(GUID) Экспорт
	
	ПлатежнаяОперацияПустаяСсылка = Документы.ПлатежнаяОперация.ПустаяСсылка();
	Попытка
		Если ЗначениеЗаполнено(GUID) Тогда
			ПлатежнаяОперацияСсылка = Документы.ПлатежнаяОперация.ПолучитьСсылку(Новый УникальныйИдентификатор(GUID));
			Если ПлатежнаяОперацияСсылка.ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода Тогда
				Возврат ПлатежнаяОперацияСсылка;
			Иначе
				Возврат ПлатежнаяОперацияПустаяСсылка;
			КонецЕсли;
		Иначе
			Возврат ПлатежнаяОперацияПустаяСсылка;
		КонецЕсли;
	Исключение
		Возврат ПлатежнаяОперацияПустаяСсылка;
	КонецПопытки;
	
КонецФункции

// Процедура - Поместить платежную операцию в kafka
//
// Параметры:
//  ActionType			 - Строка							 - Тип документа (INS, UPD)
//  ПлатежнаяОперация	 - ДокументСсылка.ПлатежнаяОперация	 - ПлатежнаяОперация
//  НачисленныйНалог	 - ДокументСсылка.НачисленныйНалог	 - НачисленныйНалог
//  ВидОперации			 - ПеречислениеСсылка.ВидыПлатежныхОпераций	 - ВыплатаДохода или ОплатаНалога
//  СтавкаНалога		 - Число									 - Ставка налога
//  Сумма				 - Число									 - Сумма оплаты
//  СтрокаПоручения		 - Структура								 - Обрабатываемая строка Поручение \ ЦенныеБумагиСписываемые
//
Процедура ПоместитьПлатежнуюОперациюВKafka(
	Знач ActionType,
	ПлатежнаяОперация,
	НачисленныйНалог,
	ВидОперации,
	СтавкаНалога,
	Сумма,
	СтрокаПоручения) Экспорт
	
	Если ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода Тогда
		Основание = ПлатежнаяОперация.Основание;
		
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoCorporateEventsIn1642;
		
		УИДДокумента = Строка(ПлатежнаяОперация.УникальныйИдентификатор());
		
		ОтправлялсяВЭДО = Документы.СводныйОтчетОСовершенныхОперациях.БылОтправленВЭДО(ПлатежнаяОперация);
		
		Если ОтправлялсяВЭДО Тогда
			// Статус UPD не предусмотрен
			Возврат;
		Иначе
			УИДСообщения = УИДДокумента;
			ActionType = "INS";
		КонецЕсли;
		
		Сущность = "PaymentCA";
		
		ДанныеКОтправке = Новый Структура;
		ДанныеКОтправке.Вставить("СтавкаНалога"			, СтавкаНалога);
		
		ДанныеКОтправке.Вставить("Сумма"				, Сумма);
		ДанныеКОтправке.Вставить("НачисленныйНалог"		, НачисленныйНалог);
		
		ДанныеКОтправке.Вставить("ПлановаяДатаРасчетов"	, СтрокаПоручения.ПлановаяДатаРасчетов);
		ДанныеКОтправке.Вставить("БанковскийСчет"		, СтрокаПоручения.БанковскийСчет);
		ДанныеКОтправке.Вставить("РазделСчетаДепо"		, СтрокаПоручения.РазделСчетаДепо);
		ДанныеКОтправке.Вставить("РазделСчетаДепоМХ"	, СтрокаПоручения.РазделСчетаДепоМХ);
		ДанныеКОтправке.Вставить("Количество"			, СтрокаПоручения.Количество);
		ДанныеКОтправке.Вставить("НДФЛУдержан"			, СтрокаПоручения.НДФЛУдержан);
		ДанныеКОтправке.Вставить("КомментарийВСтроке"	, СтрокаПоручения.Комментарий);
		
		РеквизитыПлатежныхОпераций = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежнаяОперация,
			"Получатель, GUIDПлатежа");
		ДанныеКОтправке.Вставить("Клиент"			, РеквизитыПлатежныхОпераций.Получатель);
		ДанныеКОтправке.Вставить("GUIDПлатежа"		, РеквизитыПлатежныхОпераций.GUIDПлатежа);
		
		РеквизитыОснованияВДанныеКОтправке(Основание, ДанныеКОтправке);
		
		Попытка
			ТекстJSON = СформироватьJSON(ActionType, УИДСообщения, Сущность, ДанныеКОтправке);
			Если ЗначениеЗаполнено(ТекстJSON) Тогда
				Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, ПлатежнаяОперация);
			КонецЕсли;
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		ТипНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПоручения.БанковскийСчет, "ТипНазначения");
		Если ТипНазначения = Перечисления.ТипыНазначенияБанковскихСчетов.Расчетный Тогда
			Попытка
				СоздатьУведомлениеОВыплатеНаРасчетныйСчетKafka(ДанныеКОтправке, Основание);
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру для отбора в журнале Kafka
//
// Параметры:
//  GUIDПлатежа	 - Строка - Гуид документа ПлатежнаяОперация
// 
// Возвращаемое значение:
//   - Структура - Свойство "ОтправляемыйОбъект"
//		* ОтправляемыйОбъект - ДокументСсылка.ПлатежнаяОперация - Ссылка на документ ПлатежнаяОперация
//
Функция ОтборПоРеквизитуОтправляемыйОбъектKafka(Знач GUIDПлатежа) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОтправляемыйОбъект", ПлатежнаяОперацияПоGUID(GUIDПлатежа));
	Возврат Отбор;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РеквизитыОснованияВДанныеКОтправке(Основание, ДанныеКОтправке)
	
	ОписаниеРеквизитов = Новый Структура;
	ОписаниеРеквизитов.Вставить("ВидОперацииД");
	ОписаниеРеквизитов.Вставить("СуммаИПД");
	ОписаниеРеквизитов.Вставить("ВалютаИПД", "Валюта.Код");
	ОписаниеРеквизитов.Вставить("ПериодНачисления");
	ОписаниеРеквизитов.Вставить("ЦБ");
	ОписаниеРеквизитов.Вставить("ВыплатаНа1ЦБ");
	ОписаниеРеквизитов.Вставить("ОснованиеКомментарий", "Комментарий");
	ОписаниеРеквизитов.Вставить("РеференсКД", "КарточкаКД.КДРеференсВходящий");
	ОписаниеРеквизитов.Вставить("ДатаФиксации");
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, ОписаниеРеквизитов);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеКОтправке, РеквизитыОснования);
	
	ДанныеКОтправке.Удалить("ДатаФиксации");
	Если Не ЗначениеЗаполнено(ДанныеКОтправке.РеференсКД) Тогда
		ДанныеКОтправке.РеференсКД = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОснования.ДатаФиксации) И ЗначениеЗаполнено(РеквизитыОснования.ЦБ) Тогда
		НомерКупона
			= Справочники.ЦенныеБумаги.ПараметрыКупонаПоДатеФиксации(РеквизитыОснования.ЦБ, РеквизитыОснования.ДатаФиксации, "НомерКупона");
	Иначе
		НомерКупона = Неопределено;
	КонецЕсли;
	ДанныеКОтправке.Вставить("НомерКупона"			, НомерКупона);
	
КонецПроцедуры

Функция ДанныеДляОбновленияПлатежныхОпераций(Data)
	
	ДанныеПлатежа1С = Новый Структура;
	ДанныеПлатежа1С.Вставить("GUIDПлатежа" , Data.InstructionSecOff.DepoId);
	ДанныеПлатежа1С.Вставить("СтавкаНалога", Data.TaxData.TaxRate);
	ДанныеПлатежа1С.Вставить("СуммаОплата" , Data.InstructionSecOff.IncSum);
	ДанныеПлатежа1С.Вставить("СуммаНалога" , Data.TaxData.TaxSum);
	
	Возврат ДанныеПлатежа1С;
	
КонецФункции

Процедура ОбновитьПлатежныеОперации(ИмяСобытия, Data, ДанныеПлатежа1С, ТекстОшибки)
	
	ПлатежнаяОперацияВыплатыДохода = Документы.ПлатежнаяОперация.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеПлатежа1С.GUIDПлатежа));
	Если Не ЗначениеЗаполнено(ДанныеПлатежа1С.GUIDПлатежа) Или Не ЗначениеЗаполнено(ПлатежнаяОперацияВыплатыДохода)
		Или Не ЗначениеЗаполнено(ПлатежнаяОперацияВыплатыДохода.GUIDПлатежа) Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки,
			"Не найдена Платежная операция по GUID: [" + ДанныеПлатежа1С.GUIDПлатежа + "]");
		ВызватьИсключение "";
	КонецЕсли;
	
	// Оплата дохода
	DiasData			 = Data.DiasDataIncPay;
	ЭтоОплатаНалога		 = Ложь;
	ЕстьОплатаДохода	 = ПлатежнаяОперацияОбновлена(ИмяСобытия, DiasData, ПлатежнаяОперацияВыплатыДохода, ТекстОшибки, ЭтоОплатаНалога);
	Если Не ЕстьОплатаДохода И ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение "";
	КонецЕсли;
	ТекстОшибки = "";
	
	// Оплата налога
	DiasData			 = Data.DiasDataTaxOrder;
	ЭтоОплатаНалога		 = Истина;
	ЕстьОплатаНалога	 = ПлатежнаяОперацияОбновлена(ИмяСобытия, DiasData, ПлатежнаяОперацияВыплатыДохода, ТекстОшибки, ЭтоОплатаНалога);
	Если Не ЕстьОплатаНалога И ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение "";
	КонецЕсли;
	ТекстОшибки = "";
	
	Если Не ЕстьОплатаДохода И Не ЕстьОплатаНалога Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, "Пакет не содержит информацию об оплате");
		ВызватьИсключение "";
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументПлатежнойОперации(ПлатежнаяОперацияВыплатыДохода, ТекстОшибки, ЭтоОплатаНалога)
	
	Если ЭтоОплатаНалога Тогда
		ПлатежнаяОперация = ОплатаНалогаПоВыплатеДохода(ПлатежнаяОперацияВыплатыДохода);
		Если Не ЗначениеЗаполнено(ПлатежнаяОперация) Тогда
			СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, 
				"Не найдена ОплатаНалога по ВыплатеДохода: [" + ПлатежнаяОперацияВыплатыДохода + "]");
			ПлатежнаяОперация = Документы.ПлатежнаяОперация.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ПлатежнаяОперация = ПлатежнаяОперацияВыплатыДохода;
	КонецЕсли;
	
	Возврат ПлатежнаяОперация;
	
КонецФункции

Функция ПлатежнаяОперацияОбновлена(ИмяСобытия, DiasData, ПлатежнаяОперацияВыплатыДохода, ТекстОшибки, ЭтоОплатаНалога)
	
	ЕстьОплата = ЗначениеЗаполнено(DiasData) И ЗначениеЗаполнено(DiasData.BpId);
	
	Если ЕстьОплата Тогда
		
		ПлатежнаяОперация = ДокументПлатежнойОперации(ПлатежнаяОперацияВыплатыДохода, ТекстОшибки, ЭтоОплатаНалога);
		
		МожноОбновлять = РеквизитыПлатежнойОперацииКорректны(ИмяСобытия, ПлатежнаяОперация, DiasData.Sum, ТекстОшибки);
		Если Не МожноОбновлять Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДокОбъект = ПлатежнаяОперация.ПолучитьОбъект();
		Попытка
			ДокОбъект.Валюта						 = Справочники.Валюты.ВалютаПоКоду(DiasData.Currency);
			ДокОбъект.БанковскийСчетПолучателя		 = СокрЛП(DiasData.DiasAccountNumber);
			ДокОбъект.НазначениеПлатежа				 = СокрЛП(DiasData.PaymentPurpose);
			Если ПлатежнаяОперация.Сумма <> DiasData.Sum Тогда
				ШаблонНазначенияПлатежа				 = "[ПП Dias № %1]: %2 (%3)";
				НовоеНазначениеПлатежа
					= СтрШаблон(ШаблонНазначенияПлатежа, СокрЛП(DiasData.PDocNum), СокрЛП(ДокОбъект.НазначениеПлатежа), ТекстОшибки);
				ДокОбъект.НазначениеПлатежа			 = НовоеНазначениеПлатежа;
				РежимЗаписиПлатежнойОперации		 = РежимЗаписиДокумента.Запись;
			Иначе
				РежимЗаписиПлатежнойОперации		 = РежимЗаписиДокумента.Проведение;
				ДокОбъект.Сумма						 = DiasData.Sum;
				ДокОбъект.НомерПлатежногоПоручения	 = СокрЛП(DiasData.PDocNum);
				ДокОбъект.ДокументВнешнегоИсточника	 = СтрШаблон("%1 %2 от %3",
					СокрЛП(DiasData.PDocName),
					Формат(DiasData.BpId, "ЧГ=0"),
					ПрочитатьДатуJSON(DiasData.PDocDate, ФорматДатыJSON.ISO));
			КонецЕсли;
			ДокОбъект.Записать(РежимЗаписиПлатежнойОперации);
			
		Исключение
			СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Ложь;
		КонецПопытки;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОплатаНалогаПоВыплатеДохода(ВыплатаДохода)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежнаяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	НЕ ПлатежнаяОперация.ПометкаУдаления
	|	И ПлатежнаяОперация.ВыплатаДохода = &ВыплатаДохода";
	
	Запрос.УстановитьПараметр("ВыплатаДохода", ВыплатаДохода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РеквизитыПлатежнойОперацииКорректны(ИмяСобытия, ПлатежнаяОперация, СуммаВходящая, ТекстОшибки)
	
	Если Не ЗначениеЗаполнено(ПлатежнаяОперация) Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, "Документ для обновления не обнаружен!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПлатежнаяОперация.Проведен Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, "Документ " + ПлатежнаяОперация + " уже проведен!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПлатежнаяОперация.ДокументВнешнегоИсточника)
		Или ЗначениеЗаполнено(ПлатежнаяОперация.НомерПлатежногоПоручения) Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, 
			"Заполнено поле Документ и\или НомерПлатежногоПоручения " + ПлатежнаяОперация);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПлатежнаяОперация.Сумма = СуммаВходящая Тогда
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, 
			"Сумма исполнения по " + ПлатежнаяОперация + "  не соответствует выплате [" + СуммаВходящая + "]");
		УровеньОшибка = УровеньЖурналаРегистрации.Ошибка;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньОшибка, Метаданные.Документы.ПлатежнаяОперация, ПлатежнаяОперация, ТекстОшибки);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СтрокаИлиНеопределено(ИсходнаяСтрока)
	
	Возврат ?(ЗначениеЗаполнено(ИсходнаяСтрока), СокрЛП(ИсходнаяСтрока), Неопределено);
	
КонецФункции

#Область Kafka

Функция СформироватьJSON(ActionType, УИДСообщения, Сущность, ДанныеКОтправке)
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, ActionType, "1.0.0", УИДСообщения);
	
	Data = ДанныеData(ДанныеКОтправке);
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(ДанныеКОтправке)
	
	ИмяРеквизитаКод = "Код";
	
	// Data
	OperationKind		 = OperationKindПоВидуОперацииД(ДанныеКОтправке.ВидОперацииД);
	RegistrationDate	 = ЗаписатьДатуJSON(ДанныеКОтправке.ПлановаяДатаРасчетов, ФорматДатыJSON.ISO);
	CASum				 = ДанныеКОтправке.СуммаИПД;
	CouponNum			 = ДанныеКОтправке.НомерКупона;
	Reference			 = ДанныеКОтправке.РеференсКД;
	CurrencyCodeAsset	 = ДанныеКОтправке.ВалютаИПД;
	PeriodDate			 = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(XMLСтрока(ДанныеКОтправке.ПериодНачисления));
	Comment				 = СокрЛП(ДанныеКОтправке.ОснованиеКомментарий) + СокрЛП(ДанныеКОтправке.КомментарийВСтроке);
	ОснованиеКомментарий_МаксимальнаяДлина =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("913.МаксимальнаяДлинаКомментарияВПорученииВыплатаДоходаВДенежнойФорме", 210);
	Если СтрДлина(Comment) >= ОснованиеКомментарий_МаксимальнаяДлина Тогда
		Comment = Лев(Comment, ОснованиеКомментарий_МаксимальнаяДлина);
	КонецЕсли;
	
	// Data-Asset
	ЦеннаяБумага = Новый Структура;
	ISIN = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.ЦБ, "ISIN");
	ЦеннаяБумага.Вставить("Isin"		, ISIN);
	КодНРД = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(ДанныеКОтправке.ЦБ, Справочники.КлассификаторыЗагрузки.НДЦ());
	NrdCode = ?(ЗначениеЗаполнено(КодНРД), СокрЛП(КодНРД.Код), Неопределено);
	ЦеннаяБумага.Вставить("NrdCode"		, NrdCode);
	НомерРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.ЦБ, "НомерРегистрации");
	ЦеннаяБумага.Вставить("RegNum"		, НомерРегистрации);
	
	// Data-InstructionSecOff
	InstructionSecOff = Новый Структура;
	InstructionSecOff.Вставить("DepoId"				, ДанныеКОтправке.GUIDПлатежа);
	ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.Клиент, "ЮридическиеФизическиеЛица");
	CrmClientId = Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ЮридическоеФизическоеЛицо);
	CrmClientIdЧислом = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(CrmClientId);
	InstructionSecOff.Вставить("CrmClientId"		, СтрокаИлиНеопределено(CrmClientIdЧислом));
	ContractNumber = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.Клиент, ИмяРеквизитаКод);
	InstructionSecOff.Вставить("ContractNumber"		, СокрЛП(ContractNumber));
	ДоговорКлиента = Справочники.ДоговорыКонтрагентов.ДоговорПоКлиенту(ДанныеКОтправке.Клиент);
	Если ЗначениеЗаполнено(ДоговорКлиента) Тогда
		ДатаНачалоДействияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКлиента, "ДатаНачалоДействия");
		ContractDate
			= ?(ЗначениеЗаполнено(ДатаНачалоДействияДоговора), ЗаписатьДатуJSON(ДатаНачалоДействияДоговора, ФорматДатыJSON.ISO), Неопределено);
	Иначе
		ContractDate = Неопределено;
	КонецЕсли;
	InstructionSecOff.Вставить("ContractDate"		 , ContractDate);
	AccountNumber = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.БанковскийСчет, "НомерСчета");
	InstructionSecOff.Вставить("AccountNumber"		, СтрокаИлиНеопределено(AccountNumber));
	ТипНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.БанковскийСчет, "ТипНазначения");
	Если ТипНазначения = Перечисления.ТипыНазначенияБанковскихСчетов.Брокерский Тогда
		ТипНазначенияКОтправке = "Brokerage";
	ИначеЕсли ТипНазначения = Перечисления.ТипыНазначенияБанковскихСчетов.Расчетный Тогда
		ТипНазначенияКОтправке = "Checking";
	Иначе
		ТипНазначенияКОтправке = Неопределено;
	КонецЕсли;
	InstructionSecOff.Вставить("AccountType"		, ТипНазначенияКОтправке);
	Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.БанковскийСчет, "Банк");
	Если ЗначениеЗаполнено(Банк) Тогда
		BIK = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, ИмяРеквизитаКод);
		InstructionSecOff.Вставить("BIK"			, СтрокаИлиНеопределено(BIK));
		CorrAccount = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "КоррСчет");
		InstructionSecOff.Вставить("CorrAccount"	, СтрокаИлиНеопределено(CorrAccount));
	Иначе
		InstructionSecOff.Вставить("BIK"			, Неопределено);
		InstructionSecOff.Вставить("CorrAccount"	, Неопределено);
	КонецЕсли;
	Correspondent = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.БанковскийСчет, "ТекстКорреспондента");
	InstructionSecOff.Вставить("Correspondent"		, СтрокаИлиНеопределено(Correspondent));
	AccountDivisionCode = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.РазделСчетаДепо, ИмяРеквизитаКод);
	InstructionSecOff.Вставить("AccountDivisionCode", СокрЛП(AccountDivisionCode));
	AccountExportCodeMX = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.РазделСчетаДепоМХ, ИмяРеквизитаКод);
	InstructionSecOff.Вставить("AccountExportCodeMX", СокрЛП(AccountExportCodeMX));
	InstructionSecOff.Вставить("SecQty"				, ДанныеКОтправке.Количество);
	InstructionSecOff.Вставить("IncSum"				, ДанныеКОтправке.Сумма);
	InstructionSecOff.Вставить("OneSum"				, ДанныеКОтправке.ВыплатаНа1ЦБ);
	
	// Data-TaxData
	TaxData = ДанныеTaxData(ДанныеКОтправке);
	
	// Пустые данные для модели
	DiasDataIncPay = Новый Структура;
	DiasDataIncPay.Вставить("BpId"				, Неопределено);
	DiasDataIncPay.Вставить("PDocName"			, Неопределено);
	DiasDataIncPay.Вставить("PaymentPurpose"	, Неопределено);
	DiasDataIncPay.Вставить("DiasAccountNumber"	, Неопределено);
	DiasDataIncPay.Вставить("PDocNum"			, Неопределено);
	DiasDataIncPay.Вставить("PDocDate"			, Неопределено);
	DiasDataIncPay.Вставить("Currency"			, Неопределено);
	DiasDataIncPay.Вставить("Sum"				, Неопределено);
	DiasDataTaxOrder = ОбщегоНазначения.СкопироватьСтруктуру(DiasDataIncPay);
	
	// Результирующая структура JSON
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("OperationKind"	, OperationKind);
	ДанныеДокумента.Вставить("Status"			, "PROCESS");
	ДанныеДокумента.Вставить("RegistrationDate"	, RegistrationDate);
	ДанныеДокумента.Вставить("CASum"			, CASum);
	ДанныеДокумента.Вставить("CouponNum"		, CouponNum);
	ДанныеДокумента.Вставить("Reference"		, Reference);
	ДанныеДокумента.Вставить("CurrencyCodeAsset", CurrencyCodeAsset);
	ДанныеДокумента.Вставить("PeriodDate"		, PeriodDate);
	ДанныеДокумента.Вставить("Comment"			, Comment);
	ДанныеДокумента.Вставить("Asset"			, ЦеннаяБумага);
	ДанныеДокумента.Вставить("InstructionSecOff", InstructionSecOff);
	ДанныеДокумента.Вставить("TaxData"			, TaxData);
	ДанныеДокумента.Вставить("DiasDataIncPay"	, DiasDataIncPay);
	ДанныеДокумента.Вставить("DiasDataTaxOrder"	, DiasDataTaxOrder);
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ДанныеTaxData(ДанныеКОтправке)
	
	ИменаРеквизитовДокументаНачисленныйНалог =
		"СуммаНалогаПоСтавке15СПревышения, СуммаНалога, СтавкаНалогаПовышенная, СуммаЗачетНалогаНаПрибыль,"
		+ "СтавкаИПДНалогаВИностраннойЮрисдикции, СуммаНалогаВИностраннойЮрисдикции, СтавкаНалогаСОИДН, СуммаЗачетНалогаВИностраннойЮрисдикции";
	ИмяРеквизитаTaxSum = "TaxSum";
	
	TaxData = Новый Структура;
	TaxData.Вставить("IsNdflWithheld"			, ДанныеКОтправке.НДФЛУдержан);
	TaxData.Вставить("TaxRate"					, ДанныеКОтправке.СтавкаНалога);
	Если ЗначениеЗаполнено(ДанныеКОтправке.НачисленныйНалог) И ДанныеКОтправке.СтавкаНалога > 0 Тогда
		РеквизитыДокументаНачисленныйНалог =
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКОтправке.НачисленныйНалог, ИменаРеквизитовДокументаНачисленныйНалог);
		СуммаНалогаПоСтавке15СПревышения = РеквизитыДокументаНачисленныйНалог.СуммаНалогаПоСтавке15СПревышения;
		СуммаНалога = РеквизитыДокументаНачисленныйНалог.СуммаНалога;
		СтавкаНалогаПовышенная = РеквизитыДокументаНачисленныйНалог.СтавкаНалогаПовышенная;
		Если СуммаНалога > 0 И СуммаНалогаПоСтавке15СПревышения > 0 И ДанныеКОтправке.СтавкаНалога = СтавкаНалогаПовышенная Тогда
			СуммаЗачетНалогаНаПрибыль = 0;
		Иначе
			СуммаЗачетНалогаНаПрибыль = РеквизитыДокументаНачисленныйНалог.СуммаЗачетНалогаНаПрибыль;
		КонецЕсли;
		TaxData.Вставить("SumIncomeTaxOffset"	, СуммаЗачетНалогаНаПрибыль);
		Если ДанныеКОтправке.СтавкаНалога = СтавкаНалогаПовышенная Тогда
			TaxSum = СуммаНалогаПоСтавке15СПревышения;
			TaxData.Вставить(ИмяРеквизитаTaxSum	, TaxSum);
		Иначе
			TaxSum = СуммаНалога;
			TaxData.Вставить(ИмяРеквизитаTaxSum	, TaxSum);
		КонецЕсли;
		TaxRateForeign = РеквизитыДокументаНачисленныйНалог.СтавкаИПДНалогаВИностраннойЮрисдикции;
		TaxData.Вставить("TaxRateForeign", TaxRateForeign);
		TaxSumForeign = РеквизитыДокументаНачисленныйНалог.СуммаНалогаВИностраннойЮрисдикции;
		TaxData.Вставить("TaxSumForeign", TaxSumForeign);
		TaxRateOffsetRF = РеквизитыДокументаНачисленныйНалог.СтавкаНалогаСОИДН;
		TaxData.Вставить("TaxRateOffsetRF", TaxRateOffsetRF);
		SumIncomeTaxOffsetForeign = РеквизитыДокументаНачисленныйНалог.СуммаЗачетНалогаВИностраннойЮрисдикции;
		TaxData.Вставить("SumIncomeTaxOffsetForeign", SumIncomeTaxOffsetForeign);
	Иначе
		TaxData.Вставить("SumIncomeTaxOffset"		, 0);
		TaxData.Вставить(ИмяРеквизитаTaxSum			, 0);
		TaxData.Вставить("TaxRateForeign"			, 0);
		TaxData.Вставить("TaxSumForeign"			, 0);
		TaxData.Вставить("TaxRateOffsetRF"			, 0);
		TaxData.Вставить("SumIncomeTaxOffsetForeign", 0);
	КонецЕсли;
	
	Возврат TaxData;
	
КонецФункции

Функция OperationKindПоВидуОперацииД(ВидОперацииД)
	
	Если 		ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
		OperationKind = "ACDIV";
	ИначеЕсли 	ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
		OperationKind = "RACI";
	ИначеЕсли 	ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное Тогда
		OperationKind = "RSFULL";
	ИначеЕсли 	ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное Тогда
		OperationKind = "RSPART";
	ИначеЕсли 	ВидОперацииД = Справочники.ВидыОпераций.Выкуп Тогда
		OperationKind = "BUYOUT";
	ИначеЕсли 	ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие Тогда
		OperationKind = "ACINC";
	Иначе
		OperationKind = Неопределено;
	КонецЕсли;
	
	Возврат OperationKind;
	
КонецФункции

#КонецОбласти

Процедура СоздатьПлатежныеОперацииПоНалоговойСтрокеПоручения(Основание, КлючСтрокиПоручения,
	СтрокаПоручения, НалоговыеДанные, РазмерШкалыНалогов)
	
	Если КлючСтрокиПоручения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для ИндексНалога = 1 По РазмерШкалыНалогов Цикл
		Если ИндексНалога = 1 Тогда
			СтавкаНалога	 = НалоговыеДанные.СтавкаНалогаНачисленныйНалог;
			СуммаКВыплате	 = НалоговыеДанные.СуммаКВыплатеПоОсновнаяСтавка;
			СуммаНалога		 = НалоговыеДанные.СуммаОбязательствПоУплатеНалога;
		КонецЕсли;
		Если ИндексНалога = РазмерШкалыНалогов Тогда
			СтавкаНалога	 = НалоговыеДанные.СтавкаНалогаПовышеннаяНачисленныйНалог;
			СуммаКВыплате	 = НалоговыеДанные.СуммаКВыплатеПоПовышеннаяСтавка;
			СуммаНалога		 = НалоговыеДанные.СуммаНалогаПоСтавке15СПревышения;
		КонецЕсли;
		
		Если СуммаКВыплате + СуммаНалога > 0 Тогда
			
			ОснованияОплатыНалога = Новый Структура;
			НачисленныйНалог = НачисленныйНалогПоПоручению(Основание,
				СтавкаНалога,
				СтрокаПоручения.СчетДепо,
				СтрокаПоручения.РазделСчетаДепо);
			ОснованияОплатыНалога.Вставить("НачисленныйНалог", НачисленныйНалог);
			
			ПлатежнаяОперацияВыплатаДохода = ПлатежнаяОперацияСоздатьПолучить(Основание,
				Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода,
				СтавкаНалога,
				СуммаКВыплате,
				СтрокаПоручения,
				ОснованияОплатыНалога);
			ОснованияОплатыНалога.Вставить("ВыплатаДохода", ПлатежнаяОперацияВыплатаДохода);
			
			Если ЗначениеЗаполнено(СуммаНалога) Тогда
				ПлатежнаяОперацияСоздатьПолучить(Основание,
					Перечисления.ВидыПлатежныхОпераций.ОплатаНалога,
					СтавкаНалога,
					СуммаНалога,
					СтрокаПоручения,
					ОснованияОплатыНалога);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПлатежнаяОперацияСоздатьПолучить(Основание, ВидОперации, СтавкаНалога, Сумма, СтрокаПоручения,
	ОснованияОплатыНалога = Неопределено)
	
	СчетДепо = СтрокаПоручения.СчетДепо;
	РазделСчетаДепо = СтрокаПоручения.РазделСчетаДепо;
	Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДепо, "Владелец");
	ПлановаяДатаРасчетов = СтрокаПоручения.ПлановаяДатаРасчетов;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ТекущаяПлатежнаяОперацияПоПоручению = ПлатежнаяОперацияПоПоручению(Основание,
		ВидОперации,
		СтавкаНалога,
		СчетДепо,
		РазделСчетаДепо);
	
	Если НеСоздаватьПлатежнуюОперацию(ПлановаяДатаРасчетов, ТекущаяДата, ОснованияОплатыНалога, ТекущаяПлатежнаяОперацияПоПоручению) Тогда
		Возврат ТекущаяПлатежнаяОперацияПоПоручению;
	Иначе
		
		Если ЗначениеЗаполнено(ТекущаяПлатежнаяОперацияПоПоручению) Тогда
			ПлатежнаяОперация = ТекущаяПлатежнаяОперацияПоПоручению.ПолучитьОбъект();
			ActionType = "UPD";
		Иначе
			ПлатежнаяОперация = Документы.ПлатежнаяОперация.СоздатьДокумент();
			Если Не ЗначениеЗаполнено(ОснованияОплатыНалога) Тогда
				ПлатежнаяОперация.Дата = Дата(Лев(Строка(ПлановаяДатаРасчетов), 11) + Формат(ТекущаяДата, "ДЛФ=В"));
			Иначе
				ПлатежнаяОперация.Дата = ТекущаяДата;
			КонецЕсли;
			ActionType = "INS";
		КонецЕсли;
		
		ПлатежнаяОперация.ВидОперации				 = ВидОперации;
		ПлатежнаяОперация.Основание					 = Основание;
		ПлатежнаяОперация.Получатель				 = Получатель;
		ПлатежнаяОперация.СчетДепо					 = СчетДепо;
		ПлатежнаяОперация.РазделСчетаДепо			 = РазделСчетаДепо;
		ПлатежнаяОперация.СтавкаНалога				 = СтавкаНалога;
		
		ВыплатаДоходаНалогУжеУдержан = ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение")
										И Основание.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие
										И СтрокаПоручения.НДФЛУдержан;
		Если ВыплатаДоходаНалогУжеУдержан Тогда
			ПлатежнаяОперация.Сумма					 = СтрокаПоручения.Сумма - СтрокаПоручения.СуммаНалога;
		Иначе
			ПлатежнаяОперация.Сумма					 = Сумма;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыПлатежныхОпераций.ОплатаНалога И ЗначениеЗаполнено(ОснованияОплатыНалога) Тогда
			ПлатежнаяОперация.ВыплатаДохода			 = ОснованияОплатыНалога.ВыплатаДохода;
			ПлатежнаяОперация.НачисленныйНалог		 = ОснованияОплатыНалога.НачисленныйНалог;
		КонецЕсли;
		
		ПлатежнаяОперация.Записать(РежимЗаписиДокумента.Запись);
		ПлатежнаяОперацияСсылка = ПлатежнаяОперация.Ссылка;
		
		НачисленныйНалог = ?(Не ЗначениеЗаполнено(ОснованияОплатыНалога), Неопределено, ОснованияОплатыНалога.НачисленныйНалог);
		ПоместитьПлатежнуюОперациюВKafka(ActionType,
			ПлатежнаяОперацияСсылка,
			НачисленныйНалог,
			ВидОперации,
			СтавкаНалога,
			ПлатежнаяОперация.Сумма,
			СтрокаПоручения);
		
		Возврат ПлатежнаяОперацияСсылка;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьУведомлениеОВыплатеНаРасчетныйСчетKafka(ДанныеКОтправке, Основание)
	
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.Вставить("MessageType", "EmailGen");
	MessageInfo.Вставить("JsonVersion", "1.0.0");
	MessageInfo.Вставить("SystemSource", "Depo");
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("ActionType", "UPD");
	MessageInfo.Вставить("MessageId", УИДСообщения);
	MessageInfo.Вставить("MasterMessageId", УИДСообщения);
	MessageInfo.Вставить("DateTimeCreate", ТекущаяДатаСеанса());
	
	Data = Новый Структура();
	
	ВнешнийИсточникПолучатели = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОВыплатеНаРасчетныйСчет;
	НастройкиПолучателей = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникПолучатели).Настройка;
	Получатели = НастройкиПолучателей.АдресПолучателя;
	
	Data.Вставить("Email", Получатели);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", "РассылкаУведомленийОвыплатеНаРасчетныйСчет");
	
	РеквизитыБанковскогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКОтправке.БанковскийСчет,
		Новый Структура("НомерСчета, Банк", "НомерСчета", "Банк"));
	
	AccountNumber = СокрЛП(РеквизитыБанковскогоСчета.НомерСчета);
	Банк = СокрЛП(РеквизитыБанковскогоСчета.Банк);
	
	Comment = СокрЛП(ДанныеКОтправке.ОснованиеКомментарий) + " " + СокрЛП(ДанныеКОтправке.КомментарийВСтроке);
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, Новый Структура("НомерСчета, Валюта", "БанковскийСчет.НомерСчета", "Валюта"));
	НомерСчетаПоручения = СокрЛП(РеквизитыОснования.НомерСчета);
	ТекстПисьма = "В рамках корпоративного действия создана проводка на вывод денежных средств с банковского счета "
		+ НомерСчетаПоручения + " на " + AccountNumber + ", открытому " + ДанныеКОтправке.Клиент + " в "
		+ Банк + ".
		|Назначение платежа: " + Comment + "
		|Сумма к выплате: " + ДанныеКОтправке.Сумма + " " + РеквизитыОснования.Валюта + ".";
		
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ЗаголовокСообщения", "Рассылка Уведомлений о выплате на расчетный счет");
	ReplaceFields.Вставить("ТелоСообщения", ТекстПисьма);
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;
	
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, "EmailGen", ТекстJSON);
	
КонецПроцедуры

Функция НеСоздаватьПлатежнуюОперацию(ПлановаяДатаРасчетов, ТекущаяДата, ОснованияОплатыНалога, ТекущаяПлатежнаяОперацияПоПоручению)
	ПлановыйПлатеж = (ПлановаяДатаРасчетов = НачалоДня(ТекущаяДата)) Или ОснованияОплатыНалога <> Неопределено;
	НеСоздавать = Не ПлановыйПлатеж
		Или ЗначениеЗаполнено(ТекущаяПлатежнаяОперацияПоПоручению) И ТекущаяПлатежнаяОперацияПоПоручению.Проведен;
	Возврат НеСоздавать;
КонецФункции

Функция ПлатежнаяОперацияПоПоручению(Основание, ВидОперации, СтавкаНалога, СчетДепо, РазделСчетаДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежнаяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	НЕ ПлатежнаяОперация.ПометкаУдаления
	|	И ПлатежнаяОперация.Основание = &Основание
	|	И ПлатежнаяОперация.ВидОперации = &ВидОперации
	|	И ПлатежнаяОперация.СтавкаНалога = &СтавкаНалога
	|	И ПлатежнаяОперация.СчетДепо = &СчетДепо
	|	И ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо";
	
	Запрос.УстановитьПараметр("Основание"		, Основание);
	Запрос.УстановитьПараметр("ВидОперации"		, ВидОперации);
	Запрос.УстановитьПараметр("СтавкаНалога"	, СтавкаНалога);
	Запрос.УстановитьПараметр("СчетДепо"		, СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо"	, РазделСчетаДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НачисленныйНалогПоПоручению(Основание, Ставка, СчетДепо, РазделСчетаДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачисленныйНалог.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НЕ НачисленныйНалог.ПометкаУдаления
	|	И НачисленныйНалог.Основание = &Основание
	|	И НачисленныйНалог.СчетДепо = &СчетДепо
	|	И НачисленныйНалог.РазделСчетаДепо = &РазделСчетаДепо
	|	И НачисленныйНалог.Ставка = &Ставка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачисленныйНалог.Ссылка
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НЕ НачисленныйНалог.ПометкаУдаления
	|	И НачисленныйНалог.Основание = &Основание
	|	И НачисленныйНалог.СчетДепо = &СчетДепо
	|	И НачисленныйНалог.РазделСчетаДепо = &РазделСчетаДепо
	|	И НачисленныйНалог.СтавкаНалогаПовышенная = &Ставка";
	Запрос.УстановитьПараметр("Основание"		, Основание);
	Запрос.УстановитьПараметр("Ставка"			, Ставка);
	Запрос.УстановитьПараметр("СчетДепо"		, СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо"	, РазделСчетаДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОтправитьУведомлениеОПодтвержденныхНачисленияхНалога(ДокументОснование, КлючСтрокиПоручения = Неопределено)
	
	Если КлючСтрокиПоручения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОТомЧтоНалогПодтвержденПоВыплате;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если Не ЗначениеЗаполнено(НастройкиОбмена) Тогда
		ОписаниеОшибки = "Не заполнены параметры внешнего источника '" + ВнешнийИсточник + "'";
		ЗаписьЖурналаРегистрации("РассылкаУведомленийОТомЧтоНалогПодтвержденПоВыплате",
									УровеньЖурналаРегистрации.Ошибка,
									ДокументОснование.Метаданные(),
									ДокументОснование,
									ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленныйНалог.Ссылка КАК ДокументНачисления,
	|	НачисленныйНалог.Депонент.Наименование КАК Депонент,
	|	НачисленныйНалог.СчетДепо.НомерДепозитарногоДоговора КАК Договор,
	|	НачисленныйНалог.Ставка КАК Ставка,
	|	НачисленныйНалог.СтавкаНалогаПовышенная КАК СтавкаНалогаПовышенная,
	|	НачисленныйНалог.СуммаНалога КАК НалогаКОплате,
	|	НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения КАК НалогаКОплатеПовышеннаяСтавка,
	|	НачисленныйНалог.СуммаКВыплатеПоОсновнаяСтавка КАК СуммаКВыплатеПоОсновнойСтавке,
	|	НачисленныйНалог.СуммаКВыплатеПоПовышеннаяСтавка КАК СуммаКВыплатеПоПовышеннойСтавке
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НачисленныйНалог.Основание = &Основание
	|	И ВЫБОР
	|			КОГДА &ПоВсемСчетамИРазделам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НачисленныйНалог.СчетДепо = &СчетДепо
	|					И НачисленныйНалог.РазделСчетаДепо = &РазделСчетаДепо
	|		КОНЕЦ
	|	И НачисленныйНалог.Подтвержден
	|	И НачисленныйНалог.Проведен";
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Если КлючСтрокиПоручения = Неопределено Тогда
		Запрос.УстановитьПараметр("ПоВсемСчетамИРазделам", Истина);
		Запрос.УстановитьПараметр("СчетДепо", Неопределено);
		Запрос.УстановитьПараметр("РазделСчетаДепо", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("ПоВсемСчетамИРазделам", Ложь);
		Запрос.УстановитьПараметр("СчетДепо", КлючСтрокиПоручения.СчетДепо);
		Запрос.УстановитьПараметр("РазделСчетаДепо", КлючСтрокиПоручения.РазделСчетаДепо);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТаблицаНачислений = РезультатЗапроса.Выгрузить();
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ВидОперацииД,ЦБ");
	
	Если РеквизитыОснования.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
		ОперацияКратко = "Дивиденды";
	ИначеЕсли РеквизитыОснования.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
		ОперацияКратко = "НКД";
	Иначе
		ОперацияКратко = Строка(РеквизитыОснования.ВидОперацииД);
	КонецЕсли;
	
	ТемаПисьма = "Налог подтвержден по выплате (" + ОперацияКратко + " " + Строка(РеквизитыОснования.ЦБ) + ")";
	ТекстПисьма =  ТекстУведомленияОПодтвержденныхНачисленияхНалогаНаДату(ДокументОснование, ТаблицаНачислений);

	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкиОбмена);
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	ПараметрыУведомления.Вставить("Важность"			, ВажностьИнтернетПочтовогоСообщения.Обычная);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

Функция ТекстУведомленияОПодтвержденныхНачисленияхНалогаНаДату(ДокументОснование, ТаблицаНачислений)
	
	ПС = "<br>";		// Тег HTML означает перевод строки
	ВклBold = "<b>";	// Тег HTML означает включить жирный шрифт
	ОтклBold = "</b>";	// Тег HTML означает отключить жирный шрифт
	ВыравниваниеВправо = "right";	 // Этот параметр трансформации означает, что значения в столбце будут выровнены по правому краю.
	
	Текст = "<html><BODY>" + Символы.ПС
			+ "Уважаемые коллеги," + ПС + Символы.ПС
			+ "Согласно договоренности направляю вам уведомление о подтвержденном исчисленном и подлежащем к удержанию НДФЛ "
			+ "по выплате доходов указанного(ых) клиента(ов) в 1С на основании " + Строка(ДокументОснование) + ПС + Символы.ПС;
	
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "1500");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Документ начисления");
	ПараметрыТрансформацииВHTML.Вставить("Ширина1", "300");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "Депонент");
	ПараметрыТрансформацииВHTML.Вставить("Ширина2", "300");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок3", "Договор");
	ПараметрыТрансформацииВHTML.Вставить("Ширина3", "80");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок4", "Ставка основная");
	ПараметрыТрансформацииВHTML.Вставить("Положение4", ВыравниваниеВправо);
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок5", "Ставка повышенная");
	ПараметрыТрансформацииВHTML.Вставить("Положение5", ВыравниваниеВправо);
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок6", "Налог к оплате");
	ПараметрыТрансформацииВHTML.Вставить("Положение6", ВыравниваниеВправо);
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок7", "Налог к оплате (повышенная ставка)");
	ПараметрыТрансформацииВHTML.Вставить("Положение7", ВыравниваниеВправо);
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок8", "Сумма к выплате по основной ставке");
	ПараметрыТрансформацииВHTML.Вставить("Положение8", ВыравниваниеВправо);
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок9", "Сумма к выплате по повышенной ставка");
	ПараметрыТрансформацииВHTML.Вставить("Положение9", ВыравниваниеВправо);
	
	
	ТаблицаОшибокHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТаблицаНачислений, ПараметрыТрансформацииВHTML);
	Текст = Текст + ВклBold + ПС + ТаблицаОшибокHTML + ОтклBold + ПС + Символы.ПС + "</BODY></html>";
	
	Возврат Текст;
КонецФункции

#КонецОбласти
